app/views/links/index.html.slim

      td
        - link.products.each do |product|
---
SELECT "products".* FROM "products" WHERE "products"."link_id" = 100