app/controllers/links_controller.rb

SELECT "sites".* FROM "sites" WHERE "sites"."url" = 'http://0.0.0.0:3001' LIMIT 1
SELECT "links".* FROM "links" INNER JOIN "products" ON "products"."link_id" = "links"."id" WHERE "links"."site_id" = 1 AND "products"."url" = 'http://0.0.0.0:3000/plants/3690-molinia-orange-perfection-12-tjf'
SELECT "links".* FROM "links" WHERE "links"."site_id" = 1
SELECT "products".* FROM "products" WHERE "products"."link_id" IN (67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129)
SELECT "sites".* FROM "sites" WHERE "sites"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "links".* FROM "links"
SELECT "links".* FROM "links" WHERE "links"."site_id" = 1 LIMIT 3
---
  def index
    @site = Site.find_by_url(params[:url])
    @links =  if params[:product_url].present? && Link.joins(:products).where(site_id: @site.id, products: {url: params[:product_url]}).present?
                Link.joins(:products).where(site_id: @site.id, products: {url: params[:product_url]})
              elsif Link.where(category: params[:category], site_id: @site.id).present?
                Link.where(category: params[:category], site_id: @site.id)
              else
                Link.all
              end

    respond_to do |format|
      format.html # index.html.erb
      format.json { render json: @links.shuffle.first(3), callback: params[:callback] }

SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "67"]]
---
  def edit
    @link = Link.find(params[:id])

INSERT INTO "links" ("category", "created_at", "description", "image_url", "page_url", "phrase", "product_url", "site_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @link = Link.new(params[:link])

    respond_to do |format|
      if @link.save

SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "85"]]
INSERT INTO "products" ("created_at", "link_id", "updated_at", "url") VALUES (?, ?, ?, ?)
---
  def build_product_url
    links = Link.where(id: params[:ids])
    links.each do |link|
      link.products.build(url: params[:product_url])
      link.save!

SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "67"]]
UPDATE "links" SET "category" = '', "product_url" = '', "description" = '', "updated_at" = '2013-11-11 15:24:17.184910' WHERE "links"."id" = 67
---
  def update
    @link = Link.find(params[:id])

    respond_to do |format|
      if @link.update_attributes(params[:link])

DELETE FROM "links" WHERE "links"."id" = ?  [["id", 1]]
---
  def destroy
    @link = Link.find(params[:id])
    @link.destroy