app/controllers/sites_controller.rb

SELECT "sites".* FROM "sites"
---
  def index
    @sites = Site.all

SELECT "sites".* FROM "sites" WHERE "sites"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "links".* FROM "links" WHERE "links"."site_id" = 1
SELECT "products".* FROM "products" WHERE "products"."link_id" = 67
---
  def show
    @site = Site.find(params[:id])

    @links = if @site.links.joins(:products).where(products: {url: params[:product_url]}).present?
               @site.links.joins(:products).where(products: {url: params[:product_url]})
             else
               @site.links
             end

    respond_to do |format|
      format.html # show.html.erb
      format.json { render json: @links.shuffle.first(3), callback: params[:callback] }

SELECT "sites".* FROM "sites" WHERE "sites"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @site = Site.find(params[:id])

INSERT INTO "sites" ("created_at", "description", "name", "updated_at", "url") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 07 Nov 2013 12:06:40 UTC +00:00], ["description", ""], ["name", "Новый сайт"], ["updated_at", Thu, 07 Nov 2013 12:06:40 UTC +00:00], ["url", "www.mr-kim.ru"]]
---
  def create
    @site = Site.new(params[:site])

    respond_to do |format|
      if @site.save

SELECT "sites".* FROM "sites" WHERE "sites"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "sites" SET "url" = 'http://www.mr-kim.ru', "updated_at" = '2013-11-12 05:07:31.654026' WHERE "sites"."id" = 1
---
  def update
    @site = Site.find(params[:id])

    respond_to do |format|
      if @site.update_attributes(params[:site])

SELECT "sites".* FROM "sites" WHERE "sites"."id" = ? LIMIT 1  [["id", "1"]]
---
  def import
    @site = Site.find(params[:id])