app/views/sites/index.html.slim

      td = site.description
      td = link_to "(#{site.links.size}) шт.", site_path(site)
---
SELECT COUNT(*) FROM "links" WHERE "links"."site_id" = 1